; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-42)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l1)
    (at p3 l1)
    (at p4 l4)
    (at p5 l4)
    (at p6 l3)
    (at p7 l5)
    (at v1 l2)
    (at v2 l1)
    (at v3 l7)
    (at v4 l3)
    (road l4 l10)
    (road l1 l2)
    (road l2 l1)
    (road l9 l3)
    (road l1 l5)
    (road l6 l5)
    (road l3 l7)
    (road l7 l10)
    (road l10 l4)
    (road l10 l7)
    (road l5 l1)
    (road l7 l3)
    (road l3 l9)
    (road l5 l6)
    (road l8 l2)
    (road l9 l1)
    (road l1 l9)
    (road l2 l8)
    (road l1 l7)
    (road l7 l1)
    (road l6 l7)
    (road l7 l6)
    (road l5 l10)
    (road l10 l5)
    (road l5 l9)
    (road l9 l5)
    (road l1 l6)
    (road l6 l1)
    (road l2 l10)
    (road l10 l2)
    (road l4 l8)
    (road l8 l4)
    (road l7 l9)
    (road l9 l7)
    (road l2 l5)
    (road l5 l2)
    (road l3 l6)
    (road l6 l3)
    (road l2 l4)
    (road l4 l2)
    (road l1 l4)
    (road l4 l1)
    (road l2 l7)
    (road l7 l2)
    (road l4 l6)
    (road l6 l4)
    (road l2 l6)
    (road l6 l2)
    (road l5 l7)
    (road l7 l5)
    (road l2 l3)
    (road l3 l2)
    (road l7 l8)
    (road l8 l7)
    (road l2 l9)
    (road l9 l2)
    (road l1 l3)
    (road l3 l1)
    )
 (:goal (and 
(at p1 l2)
(at p2 l3)
(at p3 l2)
(at p4 l10)
))
)

; plan
1. (pick-up v3 l7 p1 c0 c1)
   deleted: (at p1 l7) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 0 of 4
2. (pick-up v2 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v2 c2)
   added: (in p2 v2) (capacity v2 c1)
   goals met: 0 of 4
3. (pick-up v2 l1 p3 c0 c1)
   deleted: (at p3 l1) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 0 of 4
4. (drive v2 l1 l3)
   deleted: (at v2 l1)
   added: (at v2 l3)
   goals met: 0 of 4
5. (drop v2 l3 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l3) (capacity v2 c1)
   goals met: 1 of 4
6. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 1 of 4
7. (pick-up v1 l4 p4 c1 c2)
   deleted: (at p4 l4) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 1 of 4
8. (drive v1 l4 l10)
   deleted: (at v1 l4)
   added: (at v1 l10)
   goals met: 1 of 4
9. (drop v1 l10 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l10) (capacity v1 c2)
   goals met: 2 of 4
10. (drive v3 l7 l2)
   deleted: (at v3 l7)
   added: (at v3 l2)
   goals met: 2 of 4
11. (drop v3 l2 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l2) (capacity v3 c1)
   goals met: 3 of 4
12. (drive v2 l3 l2)
   deleted: (at v2 l3)
   added: (at v2 l2)
   goals met: 3 of 4
13. (drop v2 l2 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l2) (capacity v2 c2)
   goals met: 4 of 4
